function initcity(city) {
	switch (document.creator["province"].value) {
		case "绥中镇":
			var cityOptions = new Array("请选择地区", "", "绥中镇(*)", "和平居委会","兴隆居委会","东大居委会","西大居委会","城内东居委会","城内西居委会","西关居委会","文化居委会","西山居委会","新兴居委会","工人居委会","路南居委会","工人社区","和平社区","内东社区","文化社区","西关社区","西山社区","兴隆社区");
			break;
		case "永安堡乡":
			var cityOptions = new Array("请选择地区", "", "永安堡乡", "永安堡乡","大甸子村","西沟村","立根台村","花户庄村","杨树村","车场沟村","边外村","石匣口村","永安堡村","小山口村","北河村","獐狼铳村","张家房村","塔子沟");
			break;
		case "小庄子镇":
			var cityOptions = new Array("请选择地区", "", "小庄子镇", "小庄子镇","鄢家屯村","石官村","新庄子村","大李金屯村","小李村","马家洼村","团山子村","盐锅村","盐场村","大渔场村","宝仓村","叶大村","海泉村","海泉西村","彭家村","永安村","前永安寨村","小庄子村","凌家村","孤家子村","打雀庄子村","张安村","二河口");
			break;
		case "西平坡满族乡":
			var cityOptions = new Array("请选择地区", "", "西平坡满族乡(*)","西平坡满族乡","西平坡村","东平坡村","黑水汀村","七里沟村","岳家店村","大路沟村","康家壕村","炉砟沟村","南平坡村","沙金沟村","苇子沟村","土头山村","白杨沟村","龙潭沟村","上士头山村");
			break;
		case "西甸子镇":
			var cityOptions = new Array("请选择地区", "", "西甸子镇(*)", "西甸子镇","西甸子居委会","西甸子村","小李屯村","涝豆洼村","白庙子村","东庄村","马圈子村","安马堡村","北甸子村","北杨家村","水泉子村","皇姑村","户尚屯村","凉水村","大石桥村","双李村","莲蓬洼村","罗三家村");
			break;
		case "网户满族乡":
			var cityOptions = new Array("请选择地区", "", "网户满族乡(*)", "广州", "潮阳", "潮阳", "潮州", "潮州", "澄海", "澄海", "东莞", "东莞", "佛山", "佛山", "河源", "河源", "惠州", "惠州", "江门", "江门", "揭阳", "揭阳", "开平", "开平", "茂名", "茂名", "梅州", "梅州", "清远", "清远", "汕头", "汕头", "汕尾", "汕尾", "韶关", "韶关", "深圳", "深圳", "顺德", "顺德", "阳江", "阳江", "英德", "英德", "云浮", "云浮", "增城", "增城", "湛江", "湛江", "肇庆", "肇庆", "中山", "中山", "珠海", "珠海");
			break;
		case "王宝镇":
			var cityOptions = new Array("请选择地区", "", "南宁(*)", "南宁", "百色", "百色", "北海", "北海", "桂林", "桂林", "防城港", "防城港", "河池", "河池", "贺州", "贺州", "柳州", "柳州", "钦州", "钦州", "梧州", "梧州", "玉林", "玉林");
			break;
		case "万家镇":
			var cityOptions = new Array("请选择地区", "", "贵阳(*)", "贵阳", "安顺", "安顺", "毕节", "毕节", "都匀", "都匀", "凯里", "凯里", "六盘水", "六盘水", "铜仁", "铜仁", "兴义", "兴义", "玉屏", "玉屏", "遵义", "遵义");
			break;
		case "沙河镇":
			var cityOptions = new Array("请选择地区", "", "海口(*)", "海口", "儋县", "儋县", "陵水", "陵水", "琼海", "琼海", "三亚", "三亚", "通什", "通什", "万宁", "万宁");
			break;
		case "秋子沟乡":
			var cityOptions = new Array("请选择地区", "", "石家庄(*)", "石家庄", "保定", "保定", "北戴河", "北戴河", "沧州", "沧州", "承德", "承德", "丰润", "丰润", "邯郸", "邯郸", "衡水", "衡水", "廊坊", "廊坊", "南戴河", "南戴河", "秦皇岛", "秦皇岛", "唐山", "唐山", "新城", "新城", "邢台", "邢台", "张家口", "张家口");
			break;
		case "前卫镇":
			var cityOptions = new Array("请选择地区", "", "哈尔滨(*)", "哈尔滨", "北安", "北安", "大庆", "大庆", "大兴安岭", "大兴安岭", "鹤岗", "鹤岗", "黑河", "黑河", "佳木斯", "佳木斯", "鸡西", "鸡西", "牡丹江", "牡丹江", "齐齐哈尔", "齐齐哈尔", "七台河", "七台河", "双鸭山", "双鸭山", "绥化", "绥化", "伊春", "伊春");
			break;
		case "前所镇":
			var cityOptions = new Array("请选择地区", "", "郑州(*)", "郑州", "安阳", "安阳", "鹤壁", "鹤壁", "潢川", "潢川", "焦作", "焦作", "济源", "济源", "开封", "开封", "漯河", "漯河", "洛阳", "洛阳", "南阳", "南阳", "平顶山", "平顶山", "濮阳", "濮阳", "三门峡", "三门峡", "商丘", "商丘", "新乡", "新乡", "信阳", "信阳", "许昌", "许昌", "周口", "周口", "驻马店", "驻马店");
			break;
		case "明水满族乡":
			var cityOptions = new Array("请选择地区", "", "香港", "香港", "九龙", "九龙", "新界", "新界");
			break;
		case "李家堡乡":
			var cityOptions = new Array("请选择地区", "", "武汉(*)", "武汉", "恩施", "恩施", "鄂州", "鄂州", "黄冈", "黄冈", "黄石", "黄石", "荆门", "荆门", "荆州", "荆州", "潜江", "潜江", "十堰", "十堰", "随州", "随州", "武穴", "武穴", "仙桃", "仙桃", "咸宁", "咸宁", "襄阳", "襄阳", "襄樊", "襄樊", "孝感", "孝感", "宜昌", "宜昌");
			break;
		case "宽帮满族镇":
			var cityOptions = new Array("请选择地区", "", "长沙(*)", "长沙", "常德", "常德", "郴州", "郴州", "衡阳", "衡阳", "怀化", "怀化", "吉首", "吉首", "娄底", "娄底", "邵阳", "邵阳", "湘潭", "湘潭", "益阳", "益阳", "岳阳", "岳阳", "永州", "永州", "张家界", "张家界", "株洲", "株洲");
			break;
		case "加碑岩乡":
			var cityOptions = new Array("请选择地区", "", "南京(*)", "南京", "常熟", "常熟", "常州", "常州", "海门", "海门", "淮安", "淮安", "江都", "江都", "江阴", "江阴", "昆山", "昆山", "连云港", "连云港", "南通", "南通", "启东", "启东", "沭阳", "沭阳", "宿迁", "宿迁", "苏州", "苏州", "太仓", "太仓", "泰州", "泰州", "同里", "同里", "无锡", "无锡", "徐州", "徐州", "盐城", "盐城", "扬州", "扬州", "宜兴", "宜兴", "仪征", "仪征", "张家港", "张家港", "镇江", "镇江", "周庄", "周庄");
			break;
		case "荒地满族镇":
			var cityOptions = new Array("请选择地区", "", "南昌(*)", "南昌", "抚州", "抚州", "赣州", "赣州", "吉安", "吉安", "景德镇", "景德镇", "井冈山", "井冈山", "九江", "九江", "庐山", "庐山", "萍乡", "萍乡", "上饶", "上饶", "新余", "新余", "宜春", "宜春", "鹰潭", "鹰潭");
			break;
		case "塔山屯镇":
			var cityOptions = new Array("请选择地区", "", "长春(*)", "长春", "白城", "白城", "白山", "白山", "珲春", "珲春", "辽源", "辽源", "梅河", "梅河", "吉林", "吉林", "四平", "四平", "松原", "松原", "通化", "通化", "延吉", "延吉");
			break;
		case "葛家满族乡":
			var cityOptions = new Array("请选择地区", "", "沈阳(*)", "沈阳", "鞍山", "鞍山", "本溪", "本溪", "朝阳", "朝阳", "大连", "大连", "丹东", "丹东", "抚顺", "抚顺", "阜新", "阜新", "葫芦岛", "葫芦岛", "锦州", "锦州", "辽阳", "辽阳", "盘锦", "盘锦", "铁岭", "铁岭", "营口", "营口");
			break;
		case "高台镇":
			var cityOptions = new Array("请选择地区", "", "澳门", "澳门");
			break;
		case "高岭镇":
			var cityOptions = new Array("请选择地区", "", "呼和浩特(*)", "呼和浩特", "阿拉善盟", "阿拉善盟", "包头", "包头", "赤峰", "赤峰", "东胜", "东胜", "海拉尔", "海拉尔", "集宁", "集宁", "临河", "临河", "通辽", "通辽", "乌海", "乌海", "乌兰浩特", "乌兰浩特", "锡林浩特", "锡林浩特");
			break;
		case "高甸子满族乡":
			var cityOptions = new Array("请选择地区", "", "银川(*)", "银川", "固源", "固源", "石嘴山", "石嘴山", "吴忠", "吴忠");
			break;
		case "范家满族乡":
			var cityOptions = new Array("请选择地区", "", "西宁(*)", "西宁", "德令哈", "德令哈", "格尔木", "格尔木", "共和", "共和", "海东", "海东", "海晏", "海晏", "玛沁", "玛沁", "同仁", "同仁", "玉树", "玉树");
			break;
		case "大王庙满族镇":
			var cityOptions = new Array("请选择地区", "", "济南(*)", "济南", "滨州", "滨州", "兖州", "兖州", "德州", "德州", "东营", "东营", "菏泽", "菏泽", "济宁", "济宁", "莱芜", "莱芜", "聊城", "聊城", "临沂", "临沂", "蓬莱", "蓬莱", "青岛", "青岛", "曲阜", "曲阜", "日照", "日照", "泰安", "泰安", "潍坊", "潍坊", "威海", "威海", "烟台", "烟台", "枣庄", "枣庄", "淄博", "淄博");
			break;
		case "城郊乡":
			var cityOptions = new Array("请选择地区", "", "崇明", "崇明", "黄浦", "黄浦", "卢湾", "卢湾", "徐汇", "徐汇", "长宁", "长宁", "静安", "静安", "普陀", "普陀", "闸北", "闸北", "虹口", "虹口", "杨浦", "杨浦", "闵行", "闵行", "宝山", "宝山", "嘉定", "嘉定", "浦东", "浦东", "金山", "金山", "松江", "松江", "青浦", "青浦", "南汇", "南汇", "奉贤", "奉贤");
			break;
	}
	document.creator["city"].options.length = 0;
	for (var i = 0; i < cityOptions.length / 2; i++) {
		document.creator["city"].options[i] = new Option(cityOptions[i * 2], cityOptions[i * 2 + 1]);
		if (document.creator["city"].options[i].value == city) {
			document.creator["city"].selectedIndex = i;
		}
	}
}

function creatprovince(province) {
	var provinces = new Array("绥中镇","永安堡乡","小庄子镇","西平坡满族乡","西甸子镇","网户满族乡","王宝镇","万家镇","沙河镇","秋子沟乡","前卫镇","前所镇","明水满族乡","李家堡乡","宽帮满族镇","加碑岩乡","荒地满族镇","塔山屯镇","葛家满族乡","高台镇","高岭镇","高甸子满族乡","范家满族乡","大王庙满族镇","城郊乡");
	document.creator["province"].options[0] = new Option("请选择省份", "");
	for (var i = 0; i < provinces.length; i++) {
		document.creator["province"].options[i + 1] = new Option(provinces[i], provinces[i]);
		if (document.creator["province"].options[i + 1].value == province) {
			document.creator["province"].selectedIndex = i + 1;
		}
	}
}